tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/0/bottomWater/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/bottomWater";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.001 0 0);

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform (0.001 0 0);
    }
    maxX
    {
        type            inletOutlet;
        value           uniform (0.01 0 0);
        inletValue      uniform (0 0 0);
    }
    minY
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    minZ
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    maxZ
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomWater_to_rightSolid
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomWater_to_leftSolid
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomWater_to_heater
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
